{
  "backend/main.mo": "Main backend actor implementing user profile management, inquiry submission, and role-based access control with admin/user permissions. Login endpoint validates credentials (admin/admin123) but does NOT assign roles; role assignment must be done separately via assignUserRole.",
  "feature_evidence.json": "Feature evidence report documenting two features: verifying frontend login credential handling and adding console logging for authentication debugging, both with high confidence and linked to test IDs REQ-23 and REQ-24.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the admin login flow with username/password authentication, role assignment using UserRole.admin enum, and comprehensive console logging for debugging.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with coral/charcoal theme variables for light and dark modes, plus base styling for body and borders.",
  "frontend/index.html": "HTML entry point with page title 'CodeCrafter' and root div for React application mounting.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with three routes: home (/), admin login (/login), and admin dashboard (/admin/dashboard), all wrapped in shared Layout component.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying CodeCrafter agency story, statistics (150+ projects, 50+ clients, 15+ team members), and four value cards (Client-Focused, Excellence, Results-Driven, Passionate) with icons and descriptions.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with 9 fields (full name, email, phone, company, website type dropdown, features, budget, deadline, additional notes) that submits inquiries via useSubmitInquiry mutation hook with success/error feedback.",
  "frontend/src/components/HeroSection.tsx": "Hero section with background image, gradient overlay, CodeCrafter branding headline, description, and two CTA buttons ('Start Your Project' and 'View Our Work') with smooth scroll navigation.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation, mobile menu, and footer. Includes authentication-aware admin dashboard link and smooth scrolling to page sections.",
  "frontend/src/components/PortfolioSection.tsx": "Portfolio showcase section displaying a grid of 6 project cards with categories, descriptions, tags, and hover effects. Each card has a gradient background and external link icon.",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying 6 service cards (Web Development, Brand Design, Digital Marketing, Mobile Apps, SEO, Performance) with icons and hover animations in a responsive grid layout.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializes access control with admin token from URL params, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profile management, role checking, admin verification, and authentication operations including login with role assignment and inquiry management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a coral and charcoal color system, supporting both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with authentication checks, user profile management, and tabs for viewing/deleting user profiles and inquiries. Includes profile setup dialog and logout functionality.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page that authenticates users via Internet Identity and validates credentials through backend mutation, redirecting to dashboard on success.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component that composes Hero, Services, Portfolio, About, and Contact sections into a single page layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom colors (coral/charcoal), OKLCH color system, typography plugin, container queries, and custom animations.",
  "project_state.json": "Project state tracking file for a full-stack digital agency website with Node.js/Express backend and Vite/React frontend. Documents known issue with admin login authentication failing after Internet Computer deployment despite correct credentials."
}