{
  "backend/main.mo": "Main backend actor implementing user profile management, inquiry submission system, and role-based access control with admin/user permissions, including endpoints for profile CRUD, inquiry management, and role assignment.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: hidden admin route at /admin, Internet Identity authentication for admin access, and admin dashboard with management controls.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing setup, admin authentication flow, dashboard components, public pages, and shared UI components with their specific responsibilities.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light/dark themes including coral/charcoal color scheme and component-specific CSS custom properties.",
  "frontend/index.html": "HTML entry point with page title \"CodeCrafter\" and root div for React application mounting.",
  "frontend/src/App.tsx": "TanStack Router configuration defining three routes: home (/), admin login (/admin), and protected admin dashboard (/admin/dashboard) wrapped in AdminGuard, all within a shared Layout component.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying CodeCrafter company story, statistics (150+ projects, 50+ clients, 15+ team members), and four value cards (Client-Focused, Excellence, Results-Driven, Passionate) with icons and descriptions.",
  "frontend/src/components/AdminGuard.tsx": "Protected route component that verifies Internet Identity authentication and admin status via backend, showing loading states during verification and access denied UI for non-admin users, redirecting unauthenticated users to login.",
  "frontend/src/components/ContactSection.tsx": "Contact form component that collects client inquiry details (name, email, company, website type, budget, etc.) and submits them via the useSubmitInquiry hook. Includes form validation, success state handling, and displays contact information cards with social links.",
  "frontend/src/components/HeroSection.tsx": "Hero section component featuring a full-screen banner with background image, gradient overlay, headline text, and two CTA buttons that scroll to contact and portfolio sections.",
  "frontend/src/components/InquiryList.tsx": "Admin component that displays inquiries in a table with view/delete actions, includes a modal dialog for viewing full inquiry details, and handles deletion with loading states.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with sticky header navigation (desktop and mobile menu), logo, section scroll links, and footer with social media icons and copyright information.",
  "frontend/src/components/PortfolioSection.tsx": "Portfolio showcase section displaying a grid of six project cards with gradient backgrounds, categories, descriptions, technology tags, and hover effects.",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying six service cards (web development, branding, marketing, mobile apps, SEO, performance) with icons, titles, descriptions, and hover animations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control with an admin token from URL params and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles (get/save/delete), inquiries (submit/get/delete), and admin access checks, all using the useActor hook for backend communication.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design system using coral and charcoal color schemes, defining CSS variables for light/dark modes and utility classes for the brand colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for managing inquiries and user profiles, featuring logout functionality, profile setup dialog, and statistics cards showing total inquiries and users.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page that authenticates users via Internet Identity, verifies admin privileges, and redirects to dashboard on success or shows access denied error for non-admin users.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component that composes Hero, Services, Portfolio, About, and Contact sections into a single scrollable page layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (using OKLCH color space), typography, container queries, animations, and design tokens for a themed UI system.",
  "project_state.json": "Project state tracking document for a website with admin panel features, listing existing features (hidden admin route, Internet Identity authentication, admin dashboard) and pending feature requests for backend authorization and production deployment."
}