{
  "backend/main.mo": "Main Motoko actor implementing user profile management, role-based access control (admin/user), authentication via login endpoint, and public inquiry submission with storage in maps indexed by Principal and Nat.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features related to updating ContactSection with comprehensive form fields, backend integration via React Query, removal of legacy message field, and maintaining design system consistency.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration, highlighting the ContactSection's 9-field inquiry form with React Query integration and coral/charcoal design system.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with CSS custom properties for light and dark modes, including coral and charcoal theme colors, borders, and component-specific variables.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx, titled 'Digital Agency Website'.",
  "frontend/src/App.tsx": "TanStack Router configuration defining three routes (home, admin login, admin dashboard) wrapped in shared Layout component with type-safe router setup.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying company story, statistics (150+ projects, 50+ clients, 15+ team members), and four value cards (Client-Focused, Excellence, Results-Driven, Passionate) with icons and hover effects.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with 9 fields (fullName, emailAddress, phoneNumber, companyName, websiteType dropdown, features textarea, budget, deadline date picker, additionalNotes) integrated with useSubmitInquiry mutation hook, featuring loading states, success feedback, and responsive grid layout with coral/charcoal styling.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with a background image, gradient overlay, headline text, and two CTA buttons that scroll to contact and portfolio sections.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation, logo, menu items for scrolling to sections, admin/login buttons based on authentication state, mobile menu toggle, and footer with social links.",
  "frontend/src/components/PortfolioSection.tsx": "Portfolio section displaying a grid of six project cards with gradient backgrounds, categories, descriptions, tags, and hover effects with external link icons.",
  "frontend/src/components/ServicesSection.tsx": "Services section showing six service cards (web dev, branding, marketing, mobile, SEO, performance) with icons, titles, descriptions, and hover animations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializes access control with admin token, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functions with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profile CRUD, role/admin checks, and inquiry submission with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a coral and charcoal color system, light/dark mode variables, and utility classes for the brand colors.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with authentication checks, user profile management, and a table displaying all user profiles with delete functionality.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page using Internet Identity authentication with admin privilege verification and automatic redirect to dashboard upon successful login.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component that composes HeroSection, ServicesSection, PortfolioSection, AboutSection, and ContactSection into a single page layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors (coral, charcoal), OKLCH color system, typography, animations, and container settings.",
  "project_state.json": "Project metadata describing a full-stack digital agency website with Node.js/Express backend, Vite/React frontend, admin authentication, and client inquiry form features."
}