{
  "backend/main.mo": "Main Motoko actor implementing user profile management, role-based access control (admin/user roles), admin login with hardcoded credentials (admin/admin123), and public inquiry submission with CRUD operations for both profiles and inquiries.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: frontend-backend compatibility with React/Motoko integration, preservation of CodeCrafter branding (coral/charcoal theme), and Internet Computer deployment configuration.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React application structure with TanStack Router, admin dashboard, public homepage, contact form with 9 fields, and CodeCrafter branding throughout.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with coral and charcoal theme variables for light and dark modes, plus base styling for background and foreground colors.",
  "frontend/index.html": "HTML entry point with page title set to 'CodeCrafter' and root div for React mounting.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with three routes: home (/), admin login (/login), and admin dashboard (/admin/dashboard), all wrapped in shared Layout component.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying CodeCrafter company story, statistics (150+ projects, 50+ clients, 15+ team members), and four value cards (Client-Focused, Excellence, Results-Driven, Passionate) with icons and descriptions.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with 9 fields (full name, email, phone, company, website type dropdown, features textarea, budget, deadline, additional notes) that submits inquiries to backend via React Query mutation with success/error feedback.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with background image, gradient overlay, headline text, and two CTA buttons that scroll to contact and portfolio sections.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation, mobile menu, authentication state handling, admin dashboard link, and footer with social links and copyright.",
  "frontend/src/components/PortfolioSection.tsx": "Portfolio showcase section displaying a grid of 6 project cards with categories, descriptions, tags, and gradient backgrounds with hover effects.",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying 6 service cards (web dev, branding, marketing, mobile, SEO, performance) with icons, titles, and descriptions in a responsive grid.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with the backend actor, including user profile management, role/admin checks, inquiry submission and retrieval, and login functionality with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a coral and charcoal color system, supporting both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with authentication guards, profile setup dialog, and tabbed interface for managing user profiles and inquiries with delete functionality.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page with username/password form that authenticates users and redirects to the admin dashboard upon successful login.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes multiple sections including hero, services, portfolio, about, and contact components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both standard query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color palette (coral, charcoal, oklch-based theme colors), typography, container settings, animations (accordion), and extended design tokens for a modern UI system.",
  "project_state.json": "Project metadata tracking architectural decisions (Node.js/Express backend on port 5000, Vite/React frontend), existing features (admin login, dashboard, public homepage, contact form with comprehensive fields), and development workflow (single npm run dev command)."
}