{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin login authentication failing with invalid credentials error",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Verify and fix frontend AdminLoginPage.tsx to correctly send login credentials and handle authentication response",
      "acceptanceCriteria": [
        "Login form sends username and password in the correct format expected by backend",
        "Authentication response is properly parsed and stored",
        "Error handling displays backend error messages accurately",
        "Successful authentication triggers navigation to /admin/dashboard"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "Review and fix the login form submission to ensure credentials are sent correctly to the backend login method. Verify the form data structure matches the backend interface (username: string, password: string). Add console logging to track credential submission. Ensure proper error handling for authentication failures and successful authentication redirects to /admin/dashboard. Check that the useLogin hook from useQueries.ts is being used correctly and that any authentication token or session data returned from backend is properly stored."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the useLogin hook to ensure it correctly calls actor.login(username, password) with the proper parameter types. Add console logging to track the backend response. Verify that successful login response is handled correctly and any authentication token is stored appropriately. Ensure error responses from the backend are properly propagated to the UI. Check that React Query cache invalidation occurs after successful login if needed."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add console logging to frontend login submission to diagnose credential validation failure",
      "acceptanceCriteria": [
        "Frontend logs show credentials being sent to backend",
        "Logs help identify whether issue is in credential transmission, comparison logic, or response handling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "Add console.log statements to track: 1) form submission with sanitized credential info (log username but mask password), 2) right before calling the login mutation, 3) success response handling, and 4) error response handling. Include timestamps and clear labels for each log statement to facilitate debugging of the authentication flow."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add console.log statements in the useLogin hook to track: 1) parameters received by the mutation function, 2) actor availability check, 3) backend method call with parameter types, 4) raw response from backend before processing, and 5) any errors caught during the login process. This will help identify if the issue is in how credentials are passed to the backend or how responses are handled."
        }
      ]
    }
  ]
}